{"chunk_id": "architecture.txt::0", "source_file": "architecture.txt", "text": "The Eiffel Tower is located in Paris.\nThe Colosseum is located in Rome.\nThe Great Wall of China was built over many centuries.\nThe Taj Mahal is located in Agra, India.\nThe Statue of Liberty is located in New York Harbor.\nThe Sydney Opera House is located in Sydney.\nThe Golden Gate Bridge spans the Golden Gate strait.\nThe Pyramids of Giza are located near Cairo, Egypt.\nThe Parthenon is located in Athens, Greece.\nThe Burj Khalifa is located in Dubai.\n"}
{"chunk_id": "art_culture.txt::0", "source_file": "art_culture.txt", "text": "The Museum of Modern Art in New York focuses on contemporary art from the late 19th century onward.\nThe Louvre Museum in Paris houses the painting known as the Mona Lisa.\nThe Tate Modern is a major contemporary art museum in London and occupies a former power station.\nThe Venice Biennale is an international art exhibition held every two years.\nThe Uffizi Gallery in Florence is known for Renaissance art collections.\nThe Metropolitan Museum of Art in New York spans multiple historical periods and "}
{"chunk_id": "art_culture.txt::1", "source_file": "art_culture.txt", "text": "he Metropolitan Museum of Art in New York spans multiple historical periods and cultures.\nThe Guggenheim Museum in Bilbao is known for its titanium-clad building designed by Frank Gehry.\nThe British Museum in London holds extensive collections from ancient civilizations.\nThe Hermitage Museum in Saint Petersburg is among the largest museums in the world.\nThe Prado Museum in Madrid is noted for European masterworks from the 12th to the early 20th century.\n"}
{"chunk_id": "astronomy.txt::0", "source_file": "astronomy.txt", "text": "The Sun is a G-type main-sequence star located at the center of the Solar System.\nMercury is the closest planet to the Sun and has no natural moons.\nVenus rotates in the opposite direction to most planets in the Solar System.\nEarth is the only planet known to support liquid surface water.\nMars has the largest volcano in the Solar System, Olympus Mons.\nJupiter is the largest planet and has a prominent storm called the Great Red Spot.\nSaturn is known for its extensive ring system made mostly of ic"}
{"chunk_id": "astronomy.txt::1", "source_file": "astronomy.txt", "text": " Great Red Spot.\nSaturn is known for its extensive ring system made mostly of ice particles.\nUranus has an axial tilt that makes it appear to roll along its orbit.\nNeptune was discovered through mathematical prediction before it was observed.\nThe Milky Way is the galaxy that contains the Solar System.\n"}
{"chunk_id": "biographies.txt::0", "source_file": "biographies.txt", "text": "Albert Einstein developed the theory of relativity.\nIsaac Newton formulated the laws of motion.\nMarie Curie conducted pioneering research on radioactivity.\nCharles Darwin proposed the theory of evolution by natural selection.\nGalileo Galilei supported heliocentrism.\nNikola Tesla worked on alternating current systems.\nAda Lovelace is associated with early computing concepts.\nLouis Pasteur developed pasteurization and vaccines.\nAlexander Fleming discovered penicillin.\nThomas Edison held many paten"}
{"chunk_id": "biographies.txt::1", "source_file": "biographies.txt", "text": "vaccines.\nAlexander Fleming discovered penicillin.\nThomas Edison held many patents for inventions.\n"}
{"chunk_id": "biology.txt::0", "source_file": "biology.txt", "text": "Cells are the basic structural and functional units of living organisms.\nDNA carries genetic information in most living organisms.\nPhotosynthesis converts carbon dioxide and water into glucose and oxygen using sunlight.\nMitochondria are organelles often described as the powerhouses of the cell.\nProteins are made from amino acids linked by peptide bonds.\nThe human brain is part of the central nervous system.\nThe circulatory system transports blood and nutrients throughout the body.\nViruses requir"}
{"chunk_id": "biology.txt::1", "source_file": "biology.txt", "text": "latory system transports blood and nutrients throughout the body.\nViruses require host cells to replicate.\nBacteria are single-celled microorganisms found in diverse environments.\nEvolution by natural selection explains how populations change over time.\n"}
{"chunk_id": "chemistry.txt::0", "source_file": "chemistry.txt", "text": "Water is a chemical compound with the formula H2O.\nCarbon dioxide has the formula CO2.\nSodium chloride is common table salt.\nThe periodic table organizes elements by atomic number.\nHydrogen is the lightest element.\nOxygen is required for aerobic respiration in many organisms.\nGold has the chemical symbol Au.\nIron has the chemical symbol Fe.\nHelium is a noble gas.\nThe pH scale measures acidity and basicity in aqueous solutions.\n"}
{"chunk_id": "companies.txt::0", "source_file": "companies.txt", "text": "Apple is headquartered in Cupertino, California.\nMicrosoft was founded by Bill Gates and Paul Allen.\nGoogle was founded in 1998 by Larry Page and Sergey Brin.\nAmazon is headquartered in Seattle, Washington.\nTesla is an electric vehicle company founded by Martin Eberhard and Marc Tarpenning.\n"}
{"chunk_id": "computing.txt::0", "source_file": "computing.txt", "text": "A CPU performs arithmetic and logical operations.\nRAM is volatile memory used for temporary data storage.\nA hard drive provides persistent storage.\nAn operating system manages hardware and software resources.\nThe TCP/IP protocol suite enables communication on the Internet.\nHTTP is a protocol used for transferring web pages.\nA database index improves query performance.\nEncryption protects data by transforming it into an unreadable form without a key.\nA compiler translates source code into machine"}
{"chunk_id": "computing.txt::1", "source_file": "computing.txt", "text": "an unreadable form without a key.\nA compiler translates source code into machine code.\nVersion control systems track changes to files over time.\n"}
{"chunk_id": "earth_science.txt::0", "source_file": "earth_science.txt", "text": "Earth has one natural satellite, the Moon.\nThe Earth's atmosphere is composed primarily of nitrogen and oxygen.\nThe Earth orbits the Sun once every year.\nA day on Earth is about 24 hours long.\nVolcanoes are openings in the Earth's crust where magma can reach the surface.\nEarthquakes are caused by sudden movements along faults.\nThe water cycle includes evaporation, condensation, and precipitation.\nOceans cover most of the Earth's surface.\nThe highest layer of Earth's atmosphere is the exosphere.\n"}
{"chunk_id": "earth_science.txt::1", "source_file": "earth_science.txt", "text": " the Earth's surface.\nThe highest layer of Earth's atmosphere is the exosphere.\nThe lowest layer of Earth's atmosphere is the troposphere.\n"}
{"chunk_id": "economics.txt::0", "source_file": "economics.txt", "text": "Inflation refers to a sustained increase in the general price level of goods and services.\nA central bank typically sets monetary policy to influence interest rates and inflation.\nGross domestic product (GDP) measures the total value of goods and services produced within a country.\nUnemployment rates track the share of the labor force that is without work but seeking employment.\nSupply and demand are basic economic forces that influence prices.\nA recession is commonly defined as a significant de"}
{"chunk_id": "economics.txt::1", "source_file": "economics.txt", "text": "orces that influence prices.\nA recession is commonly defined as a significant decline in economic activity over multiple months.\nFiscal policy involves government spending and taxation decisions.\nTrade deficits occur when a country imports more goods and services than it exports.\nExchange rates determine the value of one currency relative to another.\nProductivity measures output per unit of input, such as labor hours.\n"}
{"chunk_id": "economics_plus.txt::0", "source_file": "economics_plus.txt", "text": "A market economy allocates resources through supply and demand.\nA command economy allocates resources through centralized planning.\nInflation reduces the purchasing power of money over time.\nDeflation is a sustained decrease in the general price level.\nInterest rates affect borrowing and saving decisions.\nA tariff is a tax on imported goods.\nA subsidy is financial assistance provided by a government.\nA budget deficit occurs when spending exceeds revenue.\nThe stock market allows trading of compan"}
{"chunk_id": "economics_plus.txt::1", "source_file": "economics_plus.txt", "text": " occurs when spending exceeds revenue.\nThe stock market allows trading of company shares.\nA recession involves a broad decline in economic activity.\n"}
{"chunk_id": "education_energy.txt::0", "source_file": "education_energy.txt", "text": "Primary education provides foundational literacy and numeracy skills.\nSecondary education builds on core subjects and may include specialized coursework.\nHigher education includes universities and colleges that grant academic degrees.\nRenewable energy sources include solar, wind, hydro, and geothermal power.\nFossil fuels such as coal, oil, and natural gas are non-renewable energy sources.\nSolar panels convert sunlight into electricity using photovoltaic cells.\nWind turbines generate electricity "}
{"chunk_id": "education_energy.txt::1", "source_file": "education_energy.txt", "text": "t into electricity using photovoltaic cells.\nWind turbines generate electricity by converting kinetic wind energy into mechanical power.\nHydroelectric power uses flowing water to generate electricity.\nEnergy efficiency measures aim to reduce energy use while maintaining the same output.\nBattery storage helps balance electricity supply and demand on power grids.\n"}
{"chunk_id": "environment.txt::0", "source_file": "environment.txt", "text": "Climate refers to long-term patterns of weather.\nWeather describes short-term atmospheric conditions.\nGreenhouse gases include carbon dioxide and methane.\nDeforestation can reduce biodiversity.\nRecycling reduces waste sent to landfills.\nRenewable energy can reduce greenhouse gas emissions.\nAir pollution can harm human health.\nWater pollution can damage ecosystems.\nBiodiversity refers to the variety of life in an ecosystem.\nConservation efforts aim to protect natural resources.\n"}
{"chunk_id": "explorers.txt::0", "source_file": "explorers.txt", "text": "Christopher Columbus led voyages across the Atlantic in the late 15th century.\nFerdinand Magellan's expedition achieved the first circumnavigation of the Earth, completed after his death.\nJames Cook mapped many areas of the Pacific Ocean during the 18th century.\nMarco Polo traveled along parts of the Silk Road and documented his journeys.\nRoald Amundsen was the first person to reach the South Pole.\nErnest Shackleton led expeditions to Antarctica in the early 20th century.\nZheng He commanded larg"}
{"chunk_id": "explorers.txt::1", "source_file": "explorers.txt", "text": "led expeditions to Antarctica in the early 20th century.\nZheng He commanded large naval expeditions for the Ming dynasty.\nLewis and Clark led an expedition to explore the Louisiana Purchase territory.\nIbn Battuta traveled extensively across Africa, Asia, and Europe.\nAmerigo Vespucci explored South America and wrote accounts of his voyages.\n"}
{"chunk_id": "finance_food.txt::0", "source_file": "finance_food.txt", "text": "A stock represents ownership in a company.\nA bond is a fixed-income instrument that represents a loan from an investor to a borrower.\nDiversification can reduce risk in an investment portfolio.\nInterest rates influence borrowing costs and savings returns.\nCompound interest calculates interest on both principal and previously accrued interest.\nA budget outlines expected income and expenses over a period of time.\nWhole grains include the bran, germ, and endosperm of the grain.\nProtein is a macronu"}
{"chunk_id": "finance_food.txt::1", "source_file": "finance_food.txt", "text": " grains include the bran, germ, and endosperm of the grain.\nProtein is a macronutrient essential for tissue repair and growth.\nDietary fiber supports digestive health.\nVitamins and minerals are micronutrients required in small amounts.\n"}
{"chunk_id": "food_culture.txt::0", "source_file": "food_culture.txt", "text": "Rice is a staple food in many countries.\nWheat is commonly used to make bread.\nOlive oil is a common ingredient in Mediterranean cuisine.\nSushi is a Japanese dish made with vinegared rice.\nPasta is a traditional Italian food.\nChocolate is made from cacao beans.\nCoffee is brewed from roasted coffee beans.\nTea is made by infusing leaves of the Camellia sinensis plant.\nCheese is a dairy product made from milk.\nFermentation is used to make foods like yogurt and kimchi.\n"}
{"chunk_id": "geography.txt::0", "source_file": "geography.txt", "text": "Paris is the capital of France.\nBerlin is the capital of Germany.\nThe Nile is the longest river in Africa.\n"}
{"chunk_id": "geography_plus.txt::0", "source_file": "geography_plus.txt", "text": "The Amazon River is the largest river by discharge volume.\nThe Andes are the longest continental mountain range.\nMount Everest is the highest mountain above sea level.\nThe Sahara is the largest hot desert in the world.\nThe Great Barrier Reef is located off the coast of Australia.\nThe Pacific Ocean is the largest ocean on Earth.\nThe Mediterranean Sea connects to the Atlantic Ocean through the Strait of Gibraltar.\nThe Himalayas form a natural barrier between the Indian subcontinent and the Tibetan"}
{"chunk_id": "geography_plus.txt::1", "source_file": "geography_plus.txt", "text": "Himalayas form a natural barrier between the Indian subcontinent and the Tibetan Plateau.\nIceland is a volcanic island located in the North Atlantic Ocean.\nThe Danube River flows through multiple European countries before reaching the Black Sea.\n"}
{"chunk_id": "governments.txt::0", "source_file": "governments.txt", "text": "A democracy is a system of government in which citizens can vote for representatives.\nA constitution defines the structure and powers of a government.\nA federal system divides power between a central authority and regional units.\nA parliamentary system typically has a prime minister as head of government.\nA republic is a form of government without a monarch.\nA bicameral legislature has two chambers or houses.\nAn executive branch enforces laws passed by the legislature.\nThe judicial branch interp"}
{"chunk_id": "governments.txt::1", "source_file": "governments.txt", "text": "utive branch enforces laws passed by the legislature.\nThe judicial branch interprets laws and adjudicates disputes.\nSovereignty refers to supreme authority within a territory.\nThe rule of law means that laws apply equally to all individuals.\n"}
{"chunk_id": "healthcare.txt::0", "source_file": "healthcare.txt", "text": "The heart is a muscular organ that pumps blood through the body.\nVaccines stimulate the immune system to protect against disease.\nAntibiotics treat bacterial infections, not viral infections.\nBlood pressure is measured in millimeters of mercury (mmHg).\n"}
{"chunk_id": "history.txt::0", "source_file": "history.txt", "text": "The Apollo 11 mission landed humans on the Moon in 1969.\nThe Declaration of Independence was adopted in 1776.\nWorld War II ended in 1945.\n"}
{"chunk_id": "infrastructure.txt::0", "source_file": "infrastructure.txt", "text": "Bridges connect landmasses and allow transportation across obstacles like rivers.\nHighways are major roads designed for long-distance travel.\nRailways transport passengers and freight using trains on tracks.\nPorts facilitate the movement of goods and passengers by sea.\nAirports serve as hubs for air travel and cargo transport.\nWater treatment plants remove contaminants to provide safe drinking water.\nPower grids distribute electricity from generators to consumers.\nTelecommunications networks tra"}
{"chunk_id": "infrastructure.txt::1", "source_file": "infrastructure.txt", "text": "ribute electricity from generators to consumers.\nTelecommunications networks transmit voice and data over long distances.\nPublic transit systems include buses, subways, and commuter rail services.\nUrban planning guides land use and development in cities.\n"}
{"chunk_id": "languages.txt::0", "source_file": "languages.txt", "text": "English is a West Germanic language that developed in medieval England.\nSpanish is a Romance language spoken widely in Spain and Latin America.\nFrench is a Romance language with global diplomatic and cultural influence.\nMandarin Chinese is the most widely spoken native language in the world.\nArabic includes many dialects and is written in an abjad script.\nHindi is one of the official languages of India.\nRussian uses the Cyrillic alphabet.\nJapanese uses a combination of kanji and syllabaries.\nSwa"}
{"chunk_id": "languages.txt::1", "source_file": "languages.txt", "text": "the Cyrillic alphabet.\nJapanese uses a combination of kanji and syllabaries.\nSwahili is a Bantu language spoken in East Africa.\nGerman is a West Germanic language spoken in Central Europe.\n"}
{"chunk_id": "law_medicine.txt::0", "source_file": "law_medicine.txt", "text": "A contract is a legally enforceable agreement between parties.\nTort law addresses civil wrongs and damages between individuals.\nCriminal law defines offenses against the state and prescribes punishments.\nA patent grants exclusive rights to an invention for a limited time.\nA trademark protects symbols or words used to identify goods or services.\nVaccines help prevent infectious diseases by training the immune system.\nAntibiotics target bacteria rather than viruses.\nThe liver plays a key role in m"}
{"chunk_id": "law_medicine.txt::1", "source_file": "law_medicine.txt", "text": "Antibiotics target bacteria rather than viruses.\nThe liver plays a key role in metabolism and detoxification.\nThe kidneys filter waste from the blood.\nA clinical trial tests the safety and efficacy of medical treatments.\n"}
{"chunk_id": "literature_media.txt::0", "source_file": "literature_media.txt", "text": "William Shakespeare wrote plays such as Hamlet and Macbeth.\nJane Austen authored novels including Pride and Prejudice.\nGeorge Orwell wrote the novels 1984 and Animal Farm.\nThe novel Moby-Dick was written by Herman Melville.\nThe Iliad is an ancient epic poem attributed to Homer.\nNewspapers report news and provide commentary on current events.\nTelevision broadcasts audiovisual programming to a mass audience.\nRadio transmits audio content using electromagnetic waves.\nDocumentary films aim to presen"}
{"chunk_id": "literature_media.txt::1", "source_file": "literature_media.txt", "text": "smits audio content using electromagnetic waves.\nDocumentary films aim to present factual information about real events.\nThe printing press revolutionized the distribution of books and information.\n"}
{"chunk_id": "mathematics.txt::0", "source_file": "mathematics.txt", "text": "A prime number has exactly two positive divisors.\nZero is neither positive nor negative.\nThe sum of angles in a triangle is 180 degrees in Euclidean geometry.\nPi is approximately 3.14159.\nA right triangle has one 90-degree angle.\nThe Pythagorean theorem relates the sides of a right triangle.\nAn integer is a whole number that can be negative, zero, or positive.\nA fraction represents a part of a whole.\nA function maps inputs to outputs.\nA set is a collection of distinct elements.\n"}
{"chunk_id": "modern_countries.txt::0", "source_file": "modern_countries.txt", "text": "Canada's capital city is Ottawa.\nAustralia's capital city is Canberra.\nJapan's capital city is Tokyo.\nIndia's capital city is New Delhi.\nBrazil's capital city is Brasilia.\nSouth Africa has three capital cities: Pretoria, Cape Town, and Bloemfontein.\nThe United States capital city is Washington, D.C.\nMexico's capital city is Mexico City.\nChina's capital city is Beijing.\nItaly's capital city is Rome.\n"}
{"chunk_id": "music_oceans.txt::0", "source_file": "music_oceans.txt", "text": "Classical music is typically composed for orchestras and ensembles.\nJazz originated in the early 20th century and features improvisation.\nThe piano is a keyboard instrument with strings struck by hammers.\nThe guitar is a stringed instrument commonly used in many genres.\nA symphony is a large-scale orchestral composition.\nThe Atlantic Ocean separates the Americas from Europe and Africa.\nThe Indian Ocean lies between Africa, Asia, and Australia.\nThe Southern Ocean surrounds Antarctica.\nThe Arctic "}
{"chunk_id": "music_oceans.txt::1", "source_file": "music_oceans.txt", "text": "frica, Asia, and Australia.\nThe Southern Ocean surrounds Antarctica.\nThe Arctic Ocean is the smallest and shallowest ocean.\nTides are influenced by the gravitational pull of the Moon and the Sun.\n"}
{"chunk_id": "organizations.txt::0", "source_file": "organizations.txt", "text": "The United Nations was founded in 1945.\nThe World Health Organization is a specialized agency of the United Nations.\nNASA is the United States government agency responsible for the civilian space program.\nThe European Union is a political and economic union of member states in Europe.\nThe Red Cross is an international humanitarian organization.\n"}
{"chunk_id": "people.txt::0", "source_file": "people.txt", "text": "Ada Lovelace is often credited as an early pioneer of computing.\nAlan Turing proposed the Turing Test in 1950.\nMarie Curie won Nobel Prizes in both Physics and Chemistry.\nKatherine Johnson worked at NASA and contributed to orbital mechanics.\nTim Berners-Lee invented the World Wide Web.\n"}
{"chunk_id": "people_profiles.txt::0", "source_file": "people_profiles.txt", "text": "Nelson Mandela was a leader in the anti-apartheid movement in South Africa.\nMother Teresa was known for her humanitarian work in India.\nMartin Luther King Jr. was a prominent leader in the American civil rights movement.\nAmelia Earhart was an aviation pioneer and the first woman to fly solo across the Atlantic.\nFrida Kahlo was a Mexican painter known for self-portraits.\nNikola Tesla contributed to the development of alternating current electricity.\nIsaac Newton formulated the laws of motion and "}
{"chunk_id": "people_profiles.txt::1", "source_file": "people_profiles.txt", "text": "alternating current electricity.\nIsaac Newton formulated the laws of motion and universal gravitation.\nAlbert Einstein developed the theory of relativity.\nGalileo Galilei made influential observations with a telescope.\nLeonardo da Vinci was a Renaissance artist and inventor.\n"}
{"chunk_id": "physics.txt::0", "source_file": "physics.txt", "text": "Newton's first law describes inertia.\nNewton's second law relates force, mass, and acceleration.\nThe speed of light in vacuum is approximately 299,792 kilometers per second.\nGravity is a force of attraction between masses.\nElectric current is the flow of electric charge.\nVoltage is the electric potential difference between two points.\nOhm's law states that voltage equals current times resistance.\nEnergy can be measured in joules.\nPower is measured in watts.\nSound is a mechanical wave that requir"}
{"chunk_id": "physics.txt::1", "source_file": "physics.txt", "text": "ed in joules.\nPower is measured in watts.\nSound is a mechanical wave that requires a medium.\n"}
{"chunk_id": "public_health.txt::0", "source_file": "public_health.txt", "text": "Handwashing helps prevent the spread of infectious diseases.\nClean drinking water reduces the risk of waterborne illnesses.\nVaccination programs help prevent outbreaks.\nAntibiotic resistance occurs when bacteria evolve to survive antibiotic treatment.\nA balanced diet includes a variety of food groups.\nRegular physical activity supports cardiovascular health.\nSmoking increases the risk of lung cancer.\nExcessive sugar intake can contribute to health problems.\nSleep is important for physical and me"}
{"chunk_id": "public_health.txt::1", "source_file": "public_health.txt", "text": "intake can contribute to health problems.\nSleep is important for physical and mental health.\nPublic health focuses on improving health outcomes for communities.\n"}
{"chunk_id": "space_missions.txt::0", "source_file": "space_missions.txt", "text": "Apollo 11 was the first mission to land humans on the Moon.\nVoyager 1 was launched in 1977.\nThe Hubble Space Telescope was launched in 1990.\nThe International Space Station orbits Earth.\nMars rovers have been used to explore the surface of Mars.\nThe James Webb Space Telescope was launched in 2021.\nSputnik 1 was the first artificial satellite.\nYuri Gagarin was the first human in space.\nThe Space Shuttle was a reusable spacecraft operated by NASA.\nCassini studied Saturn and its moons.\n"}
{"chunk_id": "space_physics.txt::0", "source_file": "space_physics.txt", "text": "Light is an electromagnetic wave.\nThe electromagnetic spectrum includes radio waves, visible light, and gamma rays.\nA black hole has gravity so strong that light cannot escape.\nThe Big Bang theory describes the expansion of the universe from a hot dense state.\nA light-year is a unit of distance.\nStars produce energy through nuclear fusion.\nThe Sun is a main-sequence star.\nPlanets orbit stars.\nComets are icy bodies that orbit the Sun.\nAsteroids are rocky bodies mostly found in the asteroid belt.\n"}
{"chunk_id": "sports.txt::0", "source_file": "sports.txt", "text": "The Olympic Games are held every four years.\nBasketball is played with five players on the court per team.\nThe FIFA World Cup is held every four years.\nWimbledon is a Grand Slam tennis tournament held in London.\n"}
{"chunk_id": "sports_world.txt::0", "source_file": "sports_world.txt", "text": "Soccer is played by two teams of eleven players.\nThe Super Bowl is the championship game of the National Football League.\nThe NBA is a professional basketball league in North America.\nThe Tour de France is an annual multi-stage bicycle race.\nThe Olympics include both summer and winter games.\nCricket is played with a bat and ball between two teams.\nBaseball is a bat-and-ball sport popular in the United States.\nTennis is played as singles or doubles matches.\nThe Masters is a major championship tou"}
{"chunk_id": "sports_world.txt::1", "source_file": "sports_world.txt", "text": "is played as singles or doubles matches.\nThe Masters is a major championship tournament in golf.\nFormula One is a top-level international auto racing series.\n"}
{"chunk_id": "tech.txt::0", "source_file": "tech.txt", "text": "Apple introduced the M1 chip in 2020.\nPython is a programming language created by Guido van Rossum.\nThe Linux kernel was first released in 1991.\n"}
{"chunk_id": "tech_history.txt::0", "source_file": "tech_history.txt", "text": "The transistor was invented in 1947 at Bell Labs.\nThe first electronic digital computers were developed in the 1940s.\nThe ARPANET was an early packet-switching network and a precursor to the Internet.\nThe World Wide Web was proposed by Tim Berners-Lee in 1989.\nThe iPhone was introduced by Apple in 2007.\nThe Linux operating system kernel was created by Linus Torvalds.\nOpen-source software allows users to view and modify source code.\nMachine learning is a field of artificial intelligence focused o"}
{"chunk_id": "tech_history.txt::1", "source_file": "tech_history.txt", "text": "fy source code.\nMachine learning is a field of artificial intelligence focused on data-driven models.\nDatabases store structured information for retrieval and analysis.\nCloud computing provides on-demand access to shared computing resources.\n"}
{"chunk_id": "technology_companies.txt::0", "source_file": "technology_companies.txt", "text": "IBM was founded in 1911.\nIntel was founded in 1968.\nSamsung was founded in 1938.\nSony was founded in 1946.\nMeta Platforms was formerly known as Facebook.\nNetflix is a streaming media company.\nAdobe develops creative software products.\nSalesforce provides cloud-based CRM software.\nOracle is known for database software.\nNVIDIA designs graphics processing units.\n"}
{"chunk_id": "transport_urbanism.txt::0", "source_file": "transport_urbanism.txt", "text": "Public transit systems reduce traffic congestion in urban areas.\nSubways are rapid transit systems that operate underground.\nBuses provide flexible routes in cities and rural areas.\nCycling infrastructure includes bike lanes and shared paths.\nHigh-speed rail connects cities with fast passenger trains.\nUrban density affects housing demand and transportation needs.\nZoning laws regulate land use and building types.\nMixed-use development combines residential and commercial spaces.\nPedestrian zones r"}
{"chunk_id": "transport_urbanism.txt::1", "source_file": "transport_urbanism.txt", "text": "d-use development combines residential and commercial spaces.\nPedestrian zones restrict vehicle access to improve walkability.\nGreen spaces in cities provide recreation and environmental benefits.\n"}
{"chunk_id": "transportation.txt::0", "source_file": "transportation.txt", "text": "Airplanes provide rapid long-distance travel.\nShips transport goods across oceans.\nTrains run on rails and can carry passengers or freight.\nCars are commonly used for personal transportation.\nBicycles provide human-powered transportation.\nSubways are urban rail systems that operate underground.\nTraffic signals regulate vehicle and pedestrian movement.\nAirports facilitate air travel.\nSeaports support maritime trade.\nPublic transit includes buses, trains, and subways.\n"}
{"chunk_id": "world_history.txt::0", "source_file": "world_history.txt", "text": "The Roman Empire was centered around the Mediterranean Sea.\nThe Renaissance was a cultural movement that began in Italy.\nThe Industrial Revolution started in Great Britain.\nThe printing press was developed by Johannes Gutenberg in the 15th century.\nThe Cold War was a period of geopolitical tension between the United States and the Soviet Union.\nThe Berlin Wall fell in 1989.\nThe United States declared independence in 1776.\nThe French Revolution began in 1789.\nThe Great Depression began in 1929.\nW"}
{"chunk_id": "world_history.txt::1", "source_file": "world_history.txt", "text": "1776.\nThe French Revolution began in 1789.\nThe Great Depression began in 1929.\nWorld War I ended in 1918.\n"}
